package com.example.adulvitc.drugdosageaquaculture.manager;

import com.example.adulvitc.drugdosageaquaculture.R;

/**
 * Created by Adulvitc on 7/8/2560.
 */

public class MyConstant {

    // For Image
    private int[] imageInts = new int[]{
            R.drawable.alfanor1,
            R.drawable.antibac1,
            R.drawable.tenamoxin1,
            R.drawable.aquac,
            R.drawable.aqaunes1,
            R.drawable.oxybac501,
            R.drawable.adekm,
            R.drawable.unknown1};


    //For Title
    private  String[] titleStrings = new String[]{
            "Alfanor 100",
            "Antibac",
            "Tenamoxin 500 WSP",
            "Aqua-C",
            "Aquanes",
            "Oxybac 50",
            "Adek-M",
            "Unknown"};


    //For Detail
    private String[] detailStrings = new String[]{
            "Enrofloxacin 10%",
            "Sulfadimethoxine 25% + Trimethoprim 5%",
            "Amoxicillin 50%",
            "Vitamin C 10%",
            "Euglenal 5%",
            "Oxytetracycline HCL 50%",
            "Vitamin & Amino Acid solution",
            "???"};


    //    For Long_Detail
    private String[] longdetailStrings = new String[]{
            "ส่วนประกอบ ใน 1 กรัมประกอบด้วย Amoxicillin trihydrate eq. to Amoxicillin 500 มิลลิกรัม\n " +
                    "สรรพคุณ เป็นยาปฏิชีวนะกึ่งสังเคราะห์ของกลุ่มยาเพนนิซิลลินมีฤทธิ์ฆ่าเชื้อแบคทีเรียทั้งแกรมบวก และแกรมลบ ที่ไวต่อยานี้\n" +
                    "ขนาดและวิธีการใช้ ผสมยาทีนาม๊อกซิน 500 ขนาด 120 – 200 มก./น้ำหนักตัว 1 กก./วัน ในอาหารให้ปลากินติดต่อกันนาน 7 – 10 วัน\n" +
                    "ระยะหยุดยา  ให้หยุดยานี้อย่างน้อย  15  วันก่อนจับกุ้งหรือปลาสำหรับบริโภค หรือจำหน่าย\n" +
                    "การเก็บรักษา  เก็บในสถานที่แห้งและเย็น อุณหภูมิ 30 OC และป้องกันแสงแดด\n" +
                    "ขนาดบรรจุ  ซอง 500 กรัม\n" +
                    "อายุการเก็บ  2 ปี",
            "ส่วนประกอบ  :  ใน 100 กรัม ประกอบด้วย Sulfadimethoxine 25 กรัม และ Trimethoprim 5 กรัม\n" +
                    "            สรรพคุณ  :  รักษาโรคติดเชื้อแบคทีเรียที่ไวต่อยานี้ เช่น Aeromonas hydrophilla, Pseudomonas spp. และ Streptococcus sp. เป็นต้น\n" +
                    "            ขนาดและวิธีการใช้  :  ผสมยาแอนตี้แบค ขนาด 100 - 170 มก./น้ำหนักตัว 1 กก./วัน ในอาหารให้ปลากินติดต่อกันนาน 7 – 10 วัน\n" +
                    "            ระยะหยุดยา  :  ให้หยุดยานี้อย่างน้อย  21 วันก่อนจับกุ้งหรือปลาสำหรับบริโภค หรือจำหน่าย\n" +
                    "            การเก็บรักษา  : เก็บในสถานที่แห้งและเย็น อุณหภูมิ 30 องศาเซลเซียส และป้องกันแสงแดด\n" +
                    "            ขนาดบรรจุ  :  กระปุก 1 ปอนด์\n" +
                    "            อายุการเก็บ  :  2 ปี",
            "ส่วนประกอบ  :  ใน 1 กรัมประกอบด้วย Amoxicillin trihydrate eq. to Amoxicillin 500 มิลลิกรัม\n" +
                    "            สรรพคุณ  :  เป็นยาปฏิชีวนะกึ่งสังเคราะห์ของกลุ่มยาเพนนิซิลลินมีฤทธิ์ฆ่าเชื้อแบคทีเรียทั้งแกรมบวก และแกรมลบ ที่ไวต่อยานี้\n" +
                    "            ขนาดและวิธีการใช้  :  ผสมยาทีนาม๊อกซิน 500 ขนาด 120 – 200 มก./น้ำหนักตัว 1 กก./วัน ในอาหารให้ปลากินติดต่อกันนาน 7 – 10 วัน\n" +
                    "            ระยะหยุดยา  :  ให้หยุดยานี้อย่างน้อย  15  วันก่อนจับกุ้งหรือปลาสำหรับบริโภค หรือจำหน่าย\n" +
                    "            การเก็บรักษา  : เก็บในสถานที่แห้งและเย็น อุณหภูมิ 30 OC และป้องกันแสงแดด\n" +
                    "            ขนาดบรรจุ  :  ซอง 500 กรัม\n" +
                    "            อายุการเก็บ  :  2 ปี",
            "ส่วนประกอบ  :  ใน 1 กก. ประกอบด้วย วิตามินซี 100 กรัม\n" +
                    "            สรรพคุณ  :  เสริมสร้างการเจริญเติบโต, ช่วยลดความเครียด, กระตุ้นภูมิคุ้มกันโรค, ช่วยให้สัตว์น้ำฟื้นตัวได้เร็วขึ้นหลังจากเจ็บป่วย และป้องกันอาการกะโหลกร้าวในปลาดุก\n" +
                    "            ขนาดและวิธีการใช้  :  ใช้อะควา-ซี ผสมอาหารได้ทั้งอาหารสดและอาหารเม็ด ในอัตราส่วน 3 – 10 กรัม / อาหาร 1 กก.\n" +
                    "            การเก็บรักษา  : เก็บในสถานที่แห้งและเย็น อุณหภูมิ 30 OC และป้องกันแสงแดด\n" +
                    "            ขนาดบรรจุ  :  ซอง 500 กรัม\n" +
                    "            อายุการเก็บ  :  1 ปี",
            "ส่วนประกอบ  :  ใน 1 กรัมประกอบด้วย Amoxicillin trihydrate eq. to Amoxicillin 500 มิลลิกรัม\n" +
                    "            สรรพคุณ  :  เป็นยาปฏิชีวนะกึ่งสังเคราะห์ของกลุ่มยาเพนนิซิลลินมีฤทธิ์ฆ่าเชื้อแบคทีเรียทั้งแกรมบวก และแกรมลบ ที่ไวต่อยานี้\n" +
                    "            ขนาดและวิธีการใช้  :  ผสมยาทีนาม๊อกซิน 500 ขนาด 120 – 200 มก./น้ำหนักตัว 1 กก./วัน ในอาหารให้ปลากินติดต่อกันนาน 7 – 10 วัน\n" +
                    "            ระยะหยุดยา  :  ให้หยุดยานี้อย่างน้อย  15  วันก่อนจับกุ้งหรือปลาสำหรับบริโภค หรือจำหน่าย\n" +
                    "            การเก็บรักษา  : เก็บในสถานที่แห้งและเย็น อุณหภูมิ 30 OC และป้องกันแสงแดด\n" +
                    "            ขนาดบรรจุ  :  ซอง 500 กรัม\n" +
                    "            อายุการเก็บ  :  2 ปี",
            "่วนประกอบ  :  ใน 100 กรัม ประกอบด้วย Oxytetracycline HCL eq. to Oxytetracycline 50 กรัม\n" +
                    "            สรรพคุณ  :  รักษาโรคติดเชื้อแบคทีเรียที่ไวต่อยานี้ เช่น Aeromonas hydrophilla, Pseudomonas spp. และ Vibio spp. เป็นต้น\n" +
                    "            ขนาดและวิธีการใช้  :  ผสมยา อ๊อกซี่แบค 50 ขนาด 120 – 200 มก./น้ำหนักตัว 1 กก./วัน ในอาหารให้ปลากินติดต่อกันนาน 7 – 10 วัน\n" +
                    "            ระยะหยุดยา  :  ให้หยุดยานี้อย่างน้อย  21 วันก่อนจับกุ้งหรือปลาสำหรับบริโภค หรือจำหน่าย\n" +
                    "            การเก็บรักษา  : เก็บในสถานที่แห้งและเย็น อุณหภูมิ 30 OC และป้องกันแสงแดด\n" +
                    "            ขนาดบรรจุ  :  กระปุก 1 ปอนด์\n" +
                    "            อายุการเก็บ  :  1 ปี",
            "ส่วนประกอบ  :  ………………\n" +
                    "            สรรพคุณ  :  เป็นวิตามินรวมและกรดอะมิโนรวมชนิดน้ำที่ช่วยเสริมวิตามิน กรดอะมิโน ไลซีน และดีแอล เมไทโอนีน, ใช้ป้องกันและรักษาการขาดวิตามินและกรดอะมิโน และป้องกันอาการเครียดอันเกิดจากสาเหตุต่างๆ เช่น ทำวัคซีน เคลื่อนย้าย เปลี่ยนอาหาร อากาศเปลี่ยนแปลง และช่วยกระตุ้นให้สัตว์ฟื้นตัวเร็วเมื่อหายจากโรคที่เป็นอยู่\n" +
                    "            ขนาดและวิธีการใช้  :  ผสมในอาหารสัตว์อัตราส่วน 1 – 2 ml. /อาหารสัตว์ 1 กก.\n" +
                    "            การเก็บรักษา  : เก็บในสถานที่แห้งและเย็น อุณหภูมิ 30 OC และป้องกันแสงแดด, หลังจากผสมน้ำให้สัตว์แล้ว ควรให้สัตว์กินให้หมดภายใน 24 ชั่วโมง\n" +
                    "            ขนาดบรรจุ  :  ขวด 1 ลิตร ( หน่วนเป็นกิโลกรัม )\n" +
                    "            อายุการเก็บ  :  1 ปี"

    };


    public int[] getImageInts() {
        return imageInts;
    }

    public String[] getTitleStrings() {
        return titleStrings;
    }

    public String[] getDetailStrings() {
        return detailStrings;
    }

    public String[] getLongdetailStrings() { return longdetailStrings; }
}  //Main Class
